Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/european_government/eu_institutions/members_of_the_european_parliament.html.txt.tmx
Source language: en
Languages: ga

source: Members of the European Parliament
ga: Baill de Pharlaimint na hEorpa

source: There are currently a total of 766 members of the European Parliament (MEP's)
ga: I láthair na huaire tá 736 Feisire de chuid Pharlaimint na hEorpa (FPE) ann

source: There are 12 members elected from Ireland (11 following 2014 elections)
ga: Toghtar 12 feisire as Éirinn (11 seo a leanas 2014 toghcháin)

source: Direct elections to the European Parliament are held every five years
ga: Reáchtáiltear toghcháin dhíreacha do Pharlaimint na hEorpa gach cúig bliana

source: Read more about european elections, nomination of candidates and eligibility for election of candidates here
ga: Léigh tuilleadh eolais faoi toghcháin eorpacha, ainmniú iarrthóirí agus incháilitheacht do thoghchán anseo

source: View a list of all current MEPs here or just details of MEPs for Irish Constituencies
ga: Féach liosta de na FPE reatha go léir anseo nó díreach sonraí FPE do Thoghcheantair na hÉireann

source: Role of Members of the European Parliament
ga: Ról Feisirí Pharlaimint na hEorpa

source: Members of the European Parliament (MEPs) meet to discuss and vote on Commission proposals for one week a month at the European Parliament in Strasbourg in France
ga: Tagann baill de Pharlaimint na hEorpa (Feisirí Eorpacha) le chéile le plé agus vótáil a dhéanamh ar mholtaí an Choimisiúin ar feadh seachtaine chuile mhí ag Parlaimint na hEorpa i Strasbourg na Fraince

source: This is called a plenary sitting
ga: Tugtar "lánsuí" ar seo

source: There are additional plenary sittings in Brussels
ga: Bíonn lánsuíonna breise sa Bhruiséal

source: The Parliament may meet in extraordinary session if the majority of its members request it, for example, if a very urgent matter arises
ga: D'fhéadfadh sé go dtiocfadh an Pharlaimint le chéile ag "seisiún neamhghnách" má éilíonn formhór na mball é seo, mar shampla, má thagann ceist fíor thábhachtach chun cinn

source: Parliamentary committees generally meet for 2 weeks a month in Brussels so that they are close to the European Commission and the Council of the European Union
ga: Tagann coistí parlaiminte le chéile go hiondúil ar feadh coicíse gach mí sa Bhruiséal le bheith gar do Choimisiún na hEorpa agus do Chomhairle Aontas na hEorpa

source: All parliamentary debates are interpreted in the Union's 24 working languages: Bulgarian, Croatian Czech, Danish, Dutch, English, Estonian, Finnish, French, German, Greek, Hungarian, Italian, Irish, Latvian, Lithuanian, Maltesese, Polish, Portuguese, Romanian, Slovakian, Slovenian, Spanish and Swedish
ga: Déantar gach díospóireacht parlaiminte a léirmhíniú i 24 teanga oibre an Aontais: Bulgáiris, Cróitis, Seicis, Danmhairgis, Ollainnis, Béarla, Eastóinis, Fionlainnis, Fraincis, Gearmáinis, Gréigis, Ungáiris, Iodáilis, Gaeilge, Laitvis, Máltais, Polainnis, Portaingéilis, Rómáinis, Slóvaicis, Slóivéinis, Spáinnis agus Sualainnis

source: All parliamentary documents are translated into and published in the 24 languages
ga: Aistrítear gach doiciméad parlaiminte go dtí na 24 teanga agus foilsítear iad iontu

source: Irish became the 23rd official and working language on 1 January, 2007
ga: Rinneadh an 23ú teanga oifigiúil agus oibre den Ghaeilge ar 1 Eanáir, 2007

source: The Parliament's work is usually a four-stage process:
ga: Próiséas le ceithre chéim í obair na Parlaiminte go hiondúil:

source: The relevant parliamentary committee appoints a member as arapporteur to draft a report on a Commission proposal
ga: Ceapann an coiste parlaiminte cuí ball ina "t(h)uairisceoir" le dréacht thuairisc a dhéanamh ar mholadh ón gCoimisiún

source: The rapporteur submits his/her draft report to the committee for discussion
ga: Cuireann an tuairisceoir a d(h)réacht-thuairisc faoi bhráid an choiste le plé

source: After consideration, the draft report is put to the vote and possibly amended
ga: Tar éis plé a dhéanamh air, cuirtear an dréacht-thuairisc chun vóta agus déantar aon leasuithe

source: The report is then discussed and debated in plenary session at the Parliament, amended and put to the vote
ga: Pléitear an tuairisc ansin agus déantar díospóireacht air ag lánseisiúin den Pharlaimint, déantar aon leasuithe agus caitear vóta

source: Once it has voted, the Parliament has adopted its position on the matter
ga: Nuair atá vóta caite ag an bParlaimint tá cinneadh tógtha aici maidir leis an ábhar

source: As well as adopting legislative proposals and the budget, the Parliament is involved in scrutinising the work of the Commission and the Council of the European Union by putting oral questions to the members of the those institutions at plenary sittings
ga: Chomh maith le glacadh le moltaí maidir le reachtaíocht agus an buiséad, tá baint ag an bParlaimint le scrúdú a dhéanamh ar obair an Choimisiúin agus Chomhairle Aontas na hEorpa tré ceisteanna béil a chur ar bhaill na n-institiúidí sin ag na lánsuíonna

source: MEPs are paid the same salary as members of their national parliaments
ga: Íoctar an tuarastal céanna le feisirí Eorpacha agus a íoctar le teachtaí i bparlaimint náisiúnta a dtíre

source: This means that Irish MEPs are paid the same salary as members of Dáil Eireann
ga: Mar sin tá an tuarastal céanna ag feisirí Eorpacha Éireannacha agus atá ag Teachtaí Dháil Éireann

source: However, on top of their salaries, MEPs are also paid an amount to cover the costs incurred by them in the performance of their duties and the recruitment of assistants
ga: Ach, sa bhreis ar a dtuarastail, íoctar suim le feisirí Eorpacha le costais a chlúdach a bhaineann lena gcuid dualgas a chur i gcrích agus le cúntóirí a earcú

source: These allowances may be cut if MEPs do not take part regularly in the work of the plenary sittings
ga: Is féidir na liúntais seo a ghearradh siar muna mbíonn feisirí Eorpacha ag glacadh páirte go rialta san obair ag na lánsuíonna

source: There are proposals to change the system so that all MEPs are paid the same salary
ga: Tá moltaí ann an córas seo a athrú le go mbeidh an tuarastal céanna dhá íoc le gach feisire Eorpach

source: In the Parliament, MEPs sit in political groups, not in national groups
ga: Sa Pharlaimint, suíonn na feisirí Eorpacha i ngrúpaí polaitiúla, ní shuíonn siad i ngrúpaí náisiúnta

source: The Parliament currently has 8 political groups plus some non-attached or independent Members
ga: Faoi láthair tá 8 ngrúpa polaitiúil sa Pharlaimint chomh maith le roinnt ball "neamh-cheangailte" nó baill neamhspléach
